# HasResolutions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionAccessor..::..HasResolutions Method
FailureDefinitionAccessor Class See Also
---
Checks if the FailureDefinition has at least one resolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasResolutions()
```

Visual Basic
---
```text
Public Function HasResolutions As Boolean
```

Visual C++
---
```text
public:
bool HasResolutions()
```

# ### Return Value
True if at least one resolution is defined in the FailureDefinition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. |

# See Also
FailureDefinitionAccessor Class
Autodesk.Revit.DB Namespace